app/controllers/api/v1/notes_controller.rb

INSERT INTO "notes" ("title", "content", "location", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @note = Note.new(note_params)
    @note.user = current_user
    @note.save

UPDATE "notes" SET "title" = $1, "content" = $2, "location" = $3, "updated_at" = $4 WHERE "notes"."id" = $5  [["title", "Why"], ["content", "turning or not and turning or not"], ["location", "Phoenix, AZ"], ["updated_at", "2018-10-24 13:29:48.473460"], ["id", 11]]
---
  def update
    @note.update(note_params)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 12]]
SELECT "notes".* FROM "notes"
---
  def destroy
    @note = Note.find(params[:id])
    @note.destroy
    @notes = Note.all